#산술 연산자
v1 = 10
v2 = 21

#덧셈
a1 = v1 + v2
print('v1 + v2 =', a1)

#뺄셈
a2 = v1 - v2
print('v1 - v2 =', a2)

#곱셈
a3 = v1 * v2
print('v1 * v2 =', a3)

#나눗셈
a4 = v2 / v1
print('v2 / v1 =', a4)

#나머지 구하기
a5 = v2 % v1
print('v2 % v1 =', a5)

#제곱
a6 = v1 ** 3
print('v1 ** 3 =', a6)

#몫 구하기
a7 = v2 // v1
print('v2 // v1 =', a7)

print('-------------------------------')

#비교 연산자. 결과값은 True False 형태.
v1 = 10
v2 = 20
v3 = 10

a1 = v1 == v2
a2 = v1 == v3
print('v1 == v2', a1)
print('v2 == v3', a2)

#대입 연산자. 오른쪽의 값을 왼쪽에 대입하는 연산자.
#a = b : b의 값을 a에 넣는다.

#논리 연산자
#and : 둘 중 하나라도 거짓이면 거짓
#or : 둘 중 하나라도 참이면 참
#not : 참을 거짓으로, 거짓을 참으로
#is : 두 매개체가 같은지
#not is : 두 매개체가 다른지